---
kind: property
id: P:Autodesk.Revit.DB.Visual.Concrete.ConcreteBmMap
source: html/4d9eef64-afec-f9ea-c923-f2514cdf575a.htm
---
# Autodesk.Revit.DB.Visual.Concrete.ConcreteBmMap Property

The property labeled "Image" from the "Concrete" schema.

## Syntax (C#)
```csharp
public static string ConcreteBmMap { get; }
```

## Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.